# Finaltask #

## постановка задачи ##
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решение не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами

## Опсание решения ##

1. Пользователь вводит с клавиатуры строки до тех пор, пока он не нажмет клавижу Escape. Каждая введенна строка вносится в массив. 

2. Поиск строк, меньших или равных 3-м символам, реалезован с помощью метода `ChoiseThre()` который в свою очередь проверяет длину каждого элемента в имеющемся массиве. При нахождении строк удовлетворяющим условию проверки (нестрогого неравенства) найденный элемент добовляется в новый массив строк (той же длины, что и переданный в данный метод массив).
Завершающий штрих в данном методе - это "Удаление" пустых элементов в новом массиве (для уменьшения занимаемой памяти):
```C#
string[] arrDelNon = newArr.Where(x => !string.IsNullOrEmpty(x)).ToArray();
```
с помощью метода `Where`, мы отбираем или получаем все не пустые значения массива и помещаем их в коллекцию типа `IEnumerable<string>`.
А затем, с помощью метода `ToArray`, создаётся новый массив, в который копируются все отобранные значения из полученной ранее коллекции.
Старый массив будет ждать сборжика мусора.

3. Метод `void PrintArrayString` производит печать массива на экран консоли. Метод реализован стандартным способом: сперва печатается открывающая скобка "[", потом все элементы массива, кроме последнего через запятную с двойными ковычками, далее выводится последний жлемент с закрывающей скобкой "]".

4. В конце кода первоночальный массив с веденными данными пользователя передается в метод `ChoiseThre()` и сохраняется в переменную `testValue`.
Для сравнения двух массивов производится печать первоночального массива и итогового с помощью методов `PrintArrayString`.

5. Сравнение длин 2-х масивов для демонтрации удалени обектов типа None
```C#
int lenghttwo = testValue.Length;
Console.WriteLine($"{letghtone}, {lenghttwo}");
```
